In [1]:
import psycopg2 as pg

In [2]:
conn= pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
print ("opened Database succesfully")

opened Database succesfully

In [9]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
print ("opened Database succesfully")

cur= conn.cursor()
cur.execute(''' CREATE TABLE EMPLOYEES 
        ( ID INT PRIMARY KEY   NOT NULL ,
        NAME           TEXT    NOT NULL , 
        AGE            INT     NOT NULL ,
        CITY           CHAR(50) , 
        SALARY            REAL); ''')
print("table created succesfully")

conn.commit()

opened Database succesfully
table created succesfully

In [13]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,CITY,SALARY) VALUES (1,'SAYED',36,'SHEBEIEN',2000.00) ");
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,CITY,SALARY) VALUES (2,'ALI',20,'SPAIN',60000.00) ");
cur.execute("INSERT INTO EMPLOYEES (ID,NAME,AGE,CITY,SALARY) VALUES (3,'HATEM',26,'MADGASCAR',1000.00) ");

conn.commit()
print("Records created succesfully")

Records created succesfully

In [14]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("SELECT id , name , city , salary FROM EMPLOYEES ")
rows = cur.fetchall()
for row in rows :
    print("ID = " , row[0])
    print("NAME = " , row[1])
    print("CITY = " , row[2])
    print("SALARY = " , row[3] , "\n")

ID =  5
NAME =  HESHAM
CITY =  SPAIN
SALARY =  60000.0

ID =  6
NAME =  EYAD
CITY =  MADGASCAR
SALARY =  1000.0

ID =  4
NAME =  MAHMOUD
CITY =  SHEBEIEN
SALARY =  2000.0

ID =  1
NAME =  SAYED
CITY =  SHEBEIEN
SALARY =  2000.0

ID =  2
NAME =  ALI
CITY =  SPAIN
SALARY =  60000.0

ID =  3
NAME =  HATEM
CITY =  MADGASCAR
SALARY =  1000.0

In [4]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("UPDATE EMPLOYEES SET salary =32100.00 WHERE ID = 4 ")
conn.commit()
cur.execute("SELECT id , name , city , salary FROM EMPLOYEES ")

rows = cur.fetchall()
for row in rows :
    print("ID = " , row[0])
    print("NAME = " , row[1])
    print("CITY = " , row[2])
    print("SALARY = " , row[3] , "\n")

ID =  5
NAME =  HESHAM
CITY =  SPAIN
SALARY =  60000.0

ID =  6
NAME =  EYAD
CITY =  MADGASCAR
SALARY =  1000.0

ID =  4
NAME =  MAHMOUD
CITY =  SHEBEIEN
SALARY =  32100.0

In [6]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("DELETE FROM EMPLOYEES WHERE ID = 4 ")
conn.commit()
cur.execute("SELECT id , name , city , salary FROM EMPLOYEES ")

rows = cur.fetchall()
for row in rows :
    print("ID = " , row[0])
    print("NAME = " , row[1])
    print("CITY = " , row[2])
    print("SALARY = " , row[3] , "\n")

ID =  5
NAME =  HESHAM
CITY =  SPAIN
SALARY =  60000.0

ID =  6
NAME =  EYAD
CITY =  MADGASCAR
SALARY =  1000.0

## DEPARTMENT

In [10]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
print ("opened Database succesfully")

cur= conn.cursor()
cur.execute(''' CREATE TABLE DEPARTMENT 
        ( ID INT PRIMARY KEY   NOT NULL ,
        EMPLOYEE_ID INT NOT NULL REFERENCES EMPLOYEES(ID) ,
        DEPARTMENT_NAME           TEXT    NOT NULL , 
        EXPERIENCE            INT     NOT NULL 
        ); ''')
print("table created succesfully")

conn.commit()

opened Database succesfully
table created succesfully

In [15]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (1,1,'ENG',4) ");
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (2,2,'ENGaRC',2) ");
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (3,3,'CS',6) ");
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (4,4,'AI',7) ");
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (5,5,'IOT',1) ");
cur.execute("INSERT INTO DEPARTMENT (ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE ) VALUES (6,6,'DS',2) ");

conn.commit()
print("Records created succesfully")

Records created succesfully

In [21]:
conn = pg.connect(database="postgres" , user="postgres" , password="root" , host="127.0.0.1" , port="5432")
cur=conn.cursor()
cur.execute("SELECT ID,EMPLOYEE_ID,DEPARTMENT_NAME,EXPERIENCE FROM DEPARTMENT ")
rows = cur.fetchall()
for row in rows :
    print("ID = " , row[0])
    print("EMPLOYEE_ID = " , row[1])
    print("DEPARTMENT_NAME = " , row[2])
    print("EXPERIENCE = " , row[3] , "\n")

ID =  1
EMPLOYEE_ID =  1
DEPARTMENT_NAME =  ENG
EXPERIENCE =  4

ID =  2
EMPLOYEE_ID =  2
DEPARTMENT_NAME =  ENGaRC
EXPERIENCE =  2

ID =  3
EMPLOYEE_ID =  3
DEPARTMENT_NAME =  CS
EXPERIENCE =  6

ID =  4
EMPLOYEE_ID =  4
DEPARTMENT_NAME =  AI
EXPERIENCE =  7

ID =  5
EMPLOYEE_ID =  5
DEPARTMENT_NAME =  IOT
EXPERIENCE =  1

ID =  6
EMPLOYEE_ID =  6
DEPARTMENT_NAME =  DS
EXPERIENCE =  2